151_what_s_the_use_of_utility_functions_youtube.org
:PROPERTIES:
:ID:       00c7e9d1-76cd-4801-883a-11c576b08596
:ROAM_REFS: https://www.youtube.com/watch?v=8AvIErXFoH8
:END:
#+title: What's the Use of Utility Functions? - YouTube
#+filetags: Artificial_Intelligence Robert_Miles Utility_Function World_States
* What is a utility function?
** World states
Utility functions arrange utilities and preferences of agents.
You can give world states numbers and in AI you have to.
*** Preferences
**** Completeness
A \succ B
A \succ B
A ~ B
**** Transitivity
Preferences are assumed to be transitive
Intransitive
*** Preferences with these properties are said to be consistent
Utility functions assume there are coherent goal directed behavior. Its actually a minimal assumption

* Personal Summary
Utility functions are a simplified assumption of an intelligent agent's ordered preference of world states.
Humans may have inconsistent behavior, but that is not the mark of an optimized intelligence.
The assumption of a utility function is valid.
