151_what_s_the_use_of_utility_functions_youtube.md

# Table of Contents

1.  [What is a utility function?](#org0753002)
    1.  [World states](#orgb4de7ab)
        1.  [Preferences](#org538222d)
        2.  [Preferences with these properties are said to be consistent](#org5e809e6)
2.  [Personal Summary](#orgfff5583)



<a id="org0753002"></a>

# What is a utility function?


<a id="orgb4de7ab"></a>

## World states

Utility functions arrange utilities and preferences of agents.
You can give world states numbers and in AI you have to.


<a id="org538222d"></a>

### Preferences

1.  Completeness

    A &sc; B
    A &sc; B
    A ~ B

2.  Transitivity

    Preferences are assumed to be transitive
    Intransitive


<a id="org5e809e6"></a>

### Preferences with these properties are said to be consistent

Utility functions assume there are coherent goal directed behavior. Its actually a minimal assumption


<a id="orgfff5583"></a>

# Personal Summary

Utility functions are a simplified assumption of an intelligent agent&rsquo;s ordered preference of world states.
Humans may have inconsistent behavior, but that is not the mark of an optimized intelligence.
The assumption of a utility function is valid.

